In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
from sklearn.preprocessing import LabelEncoder,MinMaxScaler

In [3]:
data = pd.read_csv("/home/jishnu/Desktop/ML-dataset/logistic_regression_practice.csv")
df = data.copy()

In [4]:
df.head()

   Age  Salary  Purchased
0   56   40342          1
1   46   52157          1
2   32   17327          0
3   25   55772          1
4   38   67083          1

In [5]:
df.shape

(200, 3)

In [6]:
df.describe()

              Age        Salary   Purchased
count  200.000000    200.000000  200.000000
mean    38.665000  46989.505000    0.740000
std     12.604648  19032.599241    0.439735
min     18.000000  15190.000000    0.000000
25%     27.750000  31205.250000    0.000000
50%     40.000000  48907.000000    1.000000
75%     49.250000  62339.000000    1.000000
max     59.000000  78771.000000    1.000000

In [7]:
c1 = ["Age","Salary"]

mm = MinMaxScaler()

df[c1] = mm.fit_transform(df[c1])

In [8]:
df.describe()

              Age      Salary   Purchased
count  200.000000  200.000000  200.000000
mean     0.504024    0.500142    0.740000
std      0.307430    0.299344    0.439735
min      0.000000    0.000000    0.000000
25%      0.237805    0.251887    0.000000
50%      0.536585    0.530300    1.000000
75%      0.762195    0.741558    1.000000
max      1.000000    1.000000    1.000000

In [9]:
x = df.drop("Age",axis = 1)

y = df[["Age"]]

In [12]:
from sklearn.model_selection import train_test_split

x_test,x_train,y_test,y_train = train_test_split(x,y, test_size = 0.25, random_state = 42)

In [ ]:
from sklearn.linear_model import LogisticRegression

lgr = LogisticRegression()